Catalogs/AssortmentMatrix.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>AssortmentMatrix</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Commentary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AssortmentMatrixStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodUUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Periods</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>BeginDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/AssortmentMatrixOutlets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>AssortmentMatrixOutlets</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>OutletStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ValueTableRowStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AssortmentMatrix</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AssortmentMatrix</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Outlet</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/AssortmentMatrixSKUs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>AssortmentMatrixSKUs</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Qty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Unit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UnitsOfMeasure</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SKUStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ValueTableRowStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseUnitQty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AssortmentMatrix</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AssortmentMatrix</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SKU</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/AssortmentMatrix/Ext/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	
	For Each Period In ThisObject.Periods Do
		
		If Period.UUID = New UUID("00000000-0000-0000-0000-000000000000") Then
			
			Period.UUID = New UUID();
			
		EndIf;
		
	EndDo;
	
	DeletedPeriods = New Array;
	
	For Each RefPeriod In ThisObject.Ref.Periods Do
		
		NewPeriod = ThisObject.Periods.Find(RefPeriod.UUID);
		
		If NewPeriod = Undefined Then
			
			DeletedPeriods.Add(RefPeriod);
			
		EndIf;
		
	EndDo;
	
	ThisObject.AdditionalProperties.Insert("DeletedPeriods", DeletedPeriods);
	
EndProcedure

Procedure OnWrite(Cancel)
	
	For Each DeletedPeriod In ThisObject.AdditionalProperties.DeletedPeriods Do
		
		RecordSet = InformationRegisters.AssortmentMatrixOutlets.CreateRecordSet();
		ClearRecordSet(DeletedPeriod, RecordSet);
		
		RecordSet = InformationRegisters.AssortmentMatrixSKUs.CreateRecordSet();
		ClearRecordSet(DeletedPeriod, RecordSet);
		
	EndDo;
	
	If ThisObject.AdditionalProperties.Property("NewOutletsRows") Then
	
		For Each NewRow In ThisObject.AdditionalProperties.NewOutletsRows Do
			
			RecordManager = InformationRegisters.AssortmentMatrixOutlets.CreateRecordManager();
			FillPropertyValues(RecordManager, NewRow, , "UUID");
			RecordManager.AssortmentMatrix = ThisObject.Ref;
			RecordManager.UUID = New UUID(NewRow.UUID);
			RecordManager.Write();
			
		EndDo;
		
	EndIf;
	
	If ThisObject.AdditionalProperties.Property("NewSKUsRows") Then
		
		For Each NewRow In ThisObject.AdditionalProperties.NewSKUsRows Do
			
			RecordManager = InformationRegisters.AssortmentMatrixSKUs.CreateRecordManager();
			FillPropertyValues(RecordManager, NewRow, , "UUID");
			RecordManager.AssortmentMatrix = ThisObject.Ref;
			RecordManager.UUID = New UUID(NewRow.UUID);
			RecordManager.Write();
			
		EndDo;
		
	EndIf;
	
EndProcedure

Procedure ClearRecordSet(DeletedPeriod, RecordSet)
	
	UUIDFilter = RecordSet.Filter.Find("UUID");
	UUIDFilter.Use = True;
	UUIDFilter.Value = DeletedPeriod.UUID;
	
	RecordSet.Read();
	
	RecordSet.Clear();
	
	RecordSet.Write();
	
EndProcedure
